## 04. Pandas(1)
- 파이썬 기반의 강력하고 사용하기 쉬운 데이터 분석 및 조작 라이브러리!!

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)

2.3.1

### Pandas의 핵심 자료구조
- Series
- DataFrame

### Series
- 인덱스(라벨)이 붙은 1차원 배열
- List/Numpy배열과 다르게 인덱스 이름을 직접 지정할 수 있음

In [4]:
# 시리즈 생성
# 1. 리스트로 생성
data = [10,20,30,40]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
# 2. 인덱스를 직접 지정
data = [10,20,30,40]
s = pd.Series(data, index=["a","b","c","d"])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
# 3. 딕셔너리로 시리즈 생성
data = {"서울":100, "부산":200, "대구":300}
s = pd.Series(data)
print(s)

서울    100
부산    200
대구    300
dtype: int64

In [9]:
# 4. 하나의 값으로 시리즈 생성
s = pd.Series(7, index=["가", "나", "다"])
print(s)

가    7
나    7
다    7
dtype: int64

In [14]:
# 시리즈의 주요 속성
data = [10,20,30,40]
s = pd.Series(data, index=["a","b","c","d"], name="test data")

print("values:", s.values)  # 실제 데이터 배열
print("index:", s.index)    # 인덱스 객체
print("dtype:", s.dtype)    # 실제 데이터의 타입
print("size:", s.size)      # 데이터의 개수
print("shape", s.shape)     # 배열의 형태
print("name", s.name)       # 시리즈의 이름

values: [10 20 30 40]
index: Index(['a', 'b', 'c', 'd'], dtype='object')
dtype: int64
size: 4
shape (4,)
name test data

In [ ]:
# 시리즈의 연산
# 인덱스가 일치하는 값만 연산
# 일치하지 않는 인덱스는 NaN(Not a Number)으로 표시됨
s1 = pd.Series([10,20,30], index=["a","b","c"])
s2 = pd.Series([5,6,7], index=["b","c","d"])

result = s1 +s2
print(result)

a     NaN
b    25.0
c    36.0
d     NaN
dtype: float64

In [ ]:
# 정렬되지 않은 인덱스 간 연산
# 인덱스 기준으로 연산 후 정렬해줌
s1 = pd.Series([10,20,30], index=["b","a","c"])
s2 = pd.Series([5,6,7], index=["c","b","a"])

result = s1 +s2
print(result)

a    27
b    16
c    35
dtype: int64

In [18]:
# 브로드 캐스팅
s = pd.Series([5,10,15], index=["a","b","c"])

print(s + 3)
print(s * 2)

a     8
b    13
c    18
dtype: int64
a    10
b    20
c    30
dtype: int64

In [21]:
# 불리언 연산 및 인덱싱
s = pd.Series([50,60,70,80,90,100], index=["a","b","c","d","e","f"])

# 불리언 연산(조건식)
mask = s > 70
print(mask)
print(s[mask])

a    False
b    False
c    False
d     True
e     True
f     True
dtype: bool
d     80
e     90
f    100
dtype: int64

In [25]:
# 시리즈와 NumPy 배열 연산/ 파이썬 리스트 연산
s = pd.Series([10,20,30], index=["a","b","c"])
a = np.array([1,2,3])
l = [100,200,300]

print(s + a)
print(s + l)

a    11
b    22
c    33
dtype: int64
a    110
b    220
c    330
dtype: int64

In [26]:
# 실습1 문제1.파이썬 리스트 [5, 10, 15, 20]을 이용해 Series를 생성하세요.
s1 = pd.Series([5, 10, 15, 20])
print(s1)

0     5
1    10
2    15
3    20
dtype: int64

In [28]:
# 실습1 문제2. 값 [90, 80, 85, 70]에 대해 인덱스를 각각 '국어', '영어', '수학', '과학'으로 지정한 Series를 만드세요.
s2 = pd.Series([90, 80, 85, 70], index=["국어","영어","수학","과학"])
print(s2)

국어    90
영어    80
수학    85
과학    70
dtype: int64

In [35]:
# 실습1 문제3. {'서울': 950, '부산': 340, '인천': 520} 딕셔너리를 이용해 Series를 만들고, 인천의 값을 출력하세요.
data = {"서울":950, "부산":340, "인천":520}
s3 = pd.Series(data)
print(s3)
print("인천",s3["인천"])

서울    950
부산    340
인천    520
dtype: int64
인천 520

In [36]:
# 실습1 문제4. Series [1, 2, 3, 4]를 만들고, 데이터 타입(dtype)을 출력하세요.
s4 = pd.Series([1, 2, 3, 4])
print("dtype:", s4.dtype)

dtype: int64

In [37]:
# 실습1 문제5. 아래 두 Series의 합을 구하세요.
s1 = pd.Series([3, 5, 7], index=['a', 'b', 'c'])
s2 = pd.Series([10, 20, 30], index=['b', 'c', 'd'])
s = s1 + s2
print(s)

a     NaN
b    15.0
c    27.0
d     NaN
dtype: float64

In [38]:
# 실습1 문제6. Series [1, 2, 3, 4, 5]의 각 값에 10을 더한 Series를 만드세요.
s6 = pd.Series([1, 2, 3, 4, 5])
s = s6 + 10
print(s)

0    11
1    12
2    13
3    14
4    15
dtype: int64

### DataFrame
- 2차원 라벨 데이터 구조
- 시리즈를 모아놓은 것
- 행과 열이 있고, 행과 열에 대해 라벨을 부여할 수 있음

In [ ]:
# DataFrame 생성
# 1. 딕셔너리로 생성
data = {
    "이름" : ["이안", "태훈", "태현"],
    "나이" : [15, 30, 25],
    "도시" : ["창동", "구산", "연신내"]
}

df = pd.DataFrame(data)
df.set_index()
df

   이름  나이   도시
0  이안  15   창동
1  태훈  30   구산
2  태현  25  연신내

In [46]:
# 2. 리스트의 리스트(2차원 리스트)로 생성
data = [[1,"a"], [2,"b"], [3,"c"]]
df = pd.DataFrame(data, columns=["번호", "코드"]) # columns로 라벨 지정
df

   번호 코드
0   1  a
1   2  b
2   3  c

In [68]:
# 3. 딕셔너리의 리스트로 생성
data = [
    {"이름" : "태훈", "나이" : 30, "사는곳" : "구산"},
    {"이름" : "수진", "나이" : 25, "사는곳" : "광주"},
    {"이름" : "철수", "나이" : 26, "사는곳" : "부산"},
    {"이름" : "이안", "나이" : 15, "사는곳" : "창동"}
]

df = pd.DataFrame(data, index=["a","b","c","d"])
df

   이름  나이 사는곳
a  태훈  30  구산
b  수진  25  광주
c  철수  26  부산
d  이안  15  창동

In [49]:
# 4. 시리즈의 딕셔너리로 생성
s1 = pd.Series(["국어", "수학", "영어"], index=['a', 'b', 'c'])
s2 = pd.Series([100,90,85], index=['a', 'b', 'c'])
df = pd.DataFrame({"과목":s1, "점수":s2})
df

   과목   점수
a  국어  100
b  수학   90
c  영어   85

In [56]:
# 데이터 프레임 기본 속성
data = [
    {"이름" : "태훈", "나이" : 30, "사는곳" : "구산"},
    {"이름" : "수진", "나이" : 25, "사는곳" : "광주"},
    {"이름" : "철수", "나이" : 26, "사는곳" : "부산"},
    {"이름" : "이안", "나이" : 15, "사는곳" : "창동"}
]

df = pd.DataFrame(data)

print("shape:", df.shape)
print("columns:", df.columns)
print("index:", df.index)
print("dtypes:", df.dtypes)
print("values:", df.values)
print("info:")
df.info()

shape: (4, 3)
columns: Index(['이름', '나이', '사는곳'], dtype='object')
index: RangeIndex(start=0, stop=4, step=1)
dtypes: 이름     object
나이      int64
사는곳    object
dtype: object
values: [['태훈' 30 '구산']
 ['수진' 25 '광주']
 ['철수' 26 '부산']
 ['이안' 15 '창동']]
info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   사는곳     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [58]:
# 실습2 문제1.다음 데이터로 DataFrame을 생성하고, 컬럼명을 '이름', '나이', '도시'로 지정하세요.
data = [['홍길동', 28, '서울'], ['김철수', 33, '부산'], ['이영희', 25, '대구']]
df = pd.DataFrame(data, columns=['이름', '나이', '도시'])
df

    이름  나이  도시
0  홍길동  28  서울
1  김철수  33  부산
2  이영희  25  대구

In [59]:
# 실습2 문제2. 아래와 같은 딕셔너리로 DataFrame을 생성하세요.
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [60]:
# 실습2 문제3. 아래 데이터를 사용해 DataFrame을 만드세요.
data = [{'과목': '수학', '점수': 90}, {'과목': '영어', '점수': 85}, {'과목': '과학', '점수': 95}]
df = pd.DataFrame(data)
df

   과목  점수
0  수학  90
1  영어  85
2  과학  95

In [61]:
# 실습2 문제4. 아래 데이터를 사용해 DataFrame을 생성하되, 인덱스를 ['학생1', '학생2', '학생3']으로 지정하세요.
data = {'이름': ['민수', '영희', '철수'], '점수': [80, 92, 77]}
df = pd.DataFrame(data, index=["학생1", "학생2", "학생3"])
df

     이름  점수
학생1  민수  80
학생2  영희  92
학생3  철수  77

In [62]:
# 실습2 문제5. 아래 Series 객체 2개를 이용해 DataFrame을 만드세요.
kor = pd.Series([90, 85, 80], index=['a', 'b', 'c'])
eng= pd.Series([95, 88, 82], index=['a', 'b', 'c'])
df = pd.DataFrame({"국어" : kor, "영어" : eng})
df

   국어  영어
a  90  95
b  85  88
c  80  82

In [65]:
# 실습2 문제6. 아래 딕셔너리로 DataFrame을 만들고, 컬럼 순서를 ['B', 'A']로 지정해 출력하세요.
data = {'A': [1, 2], 'B': [3, 4]}
df = pd.DataFrame(data,columns=['B','A'])
df

   B  A
0  3  1
1  4  2

In [66]:
# 실습2 문제7. 데이터를 DataFrame으로 만들고, 컬럼명을 ['product', 'price', 'stock']으로 변경하세요.
data = [['펜', 1000, 50], ['노트', 2000, 30]]
df = pd.DataFrame(data, columns=['product', 'price', 'stock'])
df

  product  price  stock
0       펜   1000     50
1      노트   2000     30

In [67]:
# 실습2 문제8. 아래 DataFrame을 생성한 뒤, '국가' 컬럼만 추출하세요.
data = {'국가': ['한국', '일본', '미국'], '수도': ['서울', '도쿄', '워싱턴']}
df = pd.DataFrame(data)
print(df)
print(df['국가'])

   국가   수도
0  한국   서울
1  일본   도쿄
2  미국  워싱턴
0    한국
1    일본
2    미국
Name: 국가, dtype: object